<?php
/**
 * -----------------------------------------
 * Desc:
 * User: Jiafang.Wang
 * Date: 2017/3/20
 * Time: 20:20
 * File: job.php
 * Project: DoctorVisit
 * -----------------------------------------
 */
return [
    'status' => [
        1 => '正常',
        0 => '待审核',
        -1 => '已删除',
    ],
    'experience' => [
        1 => '实习生',
        2 => '1-3年',
        3 => '3-5年',
        4 => '5-8年',
        5 => '8-10年',
        6 => '10年以上'
    ],

    'education' => [
        1 => '不限',
        2 => '中专',
        3 => '高中',
        4 => '大专',
        5 => '本科',
        6 => '研究生'
    ],

    'type' => [
        1 => '全职',
        2 => '兼职',
        3 => '实习',
    ],

    'welfare' => [
        1 => '五险一金',
        2 => '初创企业',
        3 => '包吃住',
        4 => '年终奖',
        5 => '十三薪',
        6 => '国内旅游',
        7 => '生日派对',
        8 => '发展空间大',
        9 => '交通补贴',
        10 => '餐费补贴',
        11 => '高速成长',
        12 => '双休',
        13 => '法定假日',
    ],

    'game_type' => [
        1 => '棋牌',
        2 => '网游',
        3 => '智力',
        4 => '竞技',
        5 => '射箭',
        6 => '桌球',
    ],

    //公司类型-公司定位
    'company_type' => [
        1 => '研发',
        2 => '发行',
        3 => '媒体',
        4 => '外包',
        5 => '渠道',
    ],
];