<?php
/**
 * -----------------------------------------
 * Desc:
 * User: Jiafang.Wang
 * Date: 2017/3/20
 * Time: 20:20
 * File: job.php
 * Project: DoctorVisit
 * -----------------------------------------
 */
return [
    'status' => [
        0 => '首页',
        1 => '专题',
    ],
    'cooperation' => [
        1 => '独代',
        2 => '联合发行',
        3 => '详谈',
    ],
    'area' => [
        1 => '国内',
        2 => '欧美',
        3 => '日韩',
        4 => '港澳台',
    ],

    'platform' => [
        1 => '安卓',
        2 => 'IOS',
        3 => 'WP',
    ],

    'type' => [
        1 => '网游',
        2 => '单机',
        3 => '弱联网',
        4 => 'H5',
    ],

    'period' => [
        1 => '立项',
        2 => 'DEMO',
        3 => '测试',
        4 => '已上线',
    ],

    'game_type' => [
        1 => '策略',
        2 => '动作',
        3 => '格斗',
        4 => '角色',
        5 => '竞速',
        6 => '经营',
        7 => '冒险',
        8 => '模拟',
        9 => '棋牌',
        10 => '射击',
        11 => '塔防',
        12 => '体育',
        13 => '休闲',
        14 => '养成',
        15 => '益智',
    ],

    'game_type_issue' => [
        1 => '策略',
        2 => '动作',
        3 => '格斗',
        4 => '角色',
        5 => '竞速',
        6 => '经营',
        7 => '冒险',
        8 => '模拟',
        9 => '棋牌',
        10 => '射击',
        11 => '塔防',
        12 => '体育',
        13 => '休闲',
        14 => '养成',
        15 => '益智',
        16 => '全部',
    ],

    //公司类型-公司定位
    'company_type' => [
        1 => '研发',
        2 => '发行',
        3 => '媒体',
        4 => '外包',
        5 => '渠道',
    ],

    //联系方式类型
    'tel_type' => [
        1 => 'QQ号',
        2 => '微信号',
        3 => '手机号',
        4 => '座机号',
    ],

    //渠道类型
    'channel' => [
        1 => '渠道找产品',
        2 => '产品找渠道',
    ],
    //外包类型
    'outsource' => [
        1 => '外包需求榜',
        2 => '外包供应榜',
    ],
    //外包前置条件
    'precondition' => [
        1 => '程序外包',
        2 => '美术外包',
        3 => '动画外包',
        4 => '音乐外包',
        5 => '测试外包',
        6 => '资质外包',
        7 => '三方支付',
    ],
    //游戏进度
    'schedule' => [
        1 => '封测',
        2 => '内测',
        3 => '公测',
    ],
    //渠道需求榜合作方式
    'channel_cooperation' => [
        1 => '联运',
    ],
    //渠道需求榜平台
    'channel_platform' => [
        1 => '安卓渠道',
        2 => '越狱渠道',
    ],
];